Revit 2021.1 API
SpatialElementType Enumeration
 An enumerated type listing types of spaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
public enum SpatialElementType
Visual Basic
Public Enumeration SpatialElementType
Visual C++
public enum class SpatialElementType
Members
Member name | Description
Room |  Room
Area |  Area
Space |  Space
See Also
Autodesk.Revit.DB Namespace